; domain
;; Woodworking
;;

(define (domain woodworking)
  (:requirements :typing :action-costs)
  (:types
   ;; 色、木材種別、木材、機械
   acolour awood woodobj machine 
   ;; 表面状態 ワニスなどの状態
   surface treatmentstatus
   ;; 板のサイズ規格、パーツサイズ規格
   aboardsize apartsize - object
   highspeed-saw glazer grinder immersion-varnisher
   planer saw spray-varnisher - machine
   board part - woodobj)

  (:constants
   verysmooth smooth rough - surface
   ;; ニス、光ってる、なにもされてない、色がついてる?
   varnished glazed untreated colourfragments - treatmentstatus
   ;; 色
   natural - acolour
   small medium large - apartsize)

  (:predicates
   ;; 切り出されていない。
   (unused ?obj - part)
   ;; 機械の中に入っておらず、または切り出されており、手で操作することができる。
   (available ?obj - woodobj)

   (surface-condition ?obj - woodobj ?surface - surface)
   (treatment ?obj - part ?treatment - treatmentstatus)
   (colour ?obj - part ?colour - acolour)

   ;; 木の種類。
   (wood ?obj - woodobj ?wood - awood)
   (boardsize ?board - board ?size - aboardsize)
   (goalsize ?part - part ?size - apartsize)
   (boardsize-successor ?size1 ?size2 - aboardsize)

   (in-highspeed-saw ?b - board ?m - highspeed-saw)
   (empty ?m - highspeed-saw)
   ;; 機械に装填されている塗料の色
   (has-colour ?machine - machine ?colour - acolour)
   (contains-part ?b - board ?p - part)
   ;; grindによる順序を規定
   (grind-treatment-change ?old ?new - treatmentstatus)
   (is-smooth ?surface - surface))
  
  (:functions (total-cost) - number
              (spray-varnish-cost ?obj - part) - number
              (glaze-cost ?obj - part) - number
              (grind-cost ?obj - part) - number
              (plane-cost ?obj - part) - number)

  ;; immersion: (液体に)浸すこと.
  ;; varnish : ニス，ワニス.
  ;; 浸すことによって塗装+ニス。
  ;; 大きさによってコストが変わらないみたいだ。
  (:action do-immersion-varnish
           :parameters (?x - part ?m - immersion-varnisher 
                           ?newcolour - acolour ?surface - surface)
           :precondition (and
                          (available ?x)
                          (has-colour ?m ?newcolour)
                          (surface-condition ?x ?surface)
                          (is-smooth ?surface)
                          (treatment ?x untreated))
           :effect (and
                    (increase (total-cost) 10) ;; コスト固定
                    (not (treatment ?x untreated))
                    (treatment ?x varnished)
                    (not (colour ?x natural))
                    (colour ?x ?newcolour)))

  ;; スプレーによって塗装+ニス。
  (:action do-spray-varnish
           :parameters (?x - part ?m - spray-varnisher 
                           ?newcolour - acolour ?surface - surface)
           :precondition (and
                          (available ?x)
                          (has-colour ?m ?newcolour)
                          (surface-condition ?x ?surface)
                          (is-smooth ?surface)
                          (treatment ?x untreated))
           :effect (and 
                    (increase (total-cost) (spray-varnish-cost ?x))
                    (not (treatment ?x untreated))
                    (treatment ?x varnished)
                    (not (colour ?x natural))
                    (colour ?x ?newcolour)))

  

  ;;〈紙・布・皮などに〉光滑剤を塗る，つやつけをする.
  (:action do-glaze
           :parameters (?x - part ?m - glazer 
                           ?newcolour - acolour)
           :precondition (and
                          (available ?x)
                          (has-colour ?m ?newcolour)
                          (treatment ?x untreated))
           :effect (and 
                    (increase (total-cost) (glaze-cost ?x))
                    (not (treatment ?x untreated))
                    (treatment ?x glazed)
                    (not (colour ?x natural))
                    (colour ?x ?newcolour)))

  ;; 削ってverysmoothに。塗装をやり直し。色は消える。
  (:action do-grind
           :parameters (?x - part ?m - grinder ?oldsurface - surface
                           ?oldcolour - acolour 
                           ?oldtreatment ?newtreatment - treatmentstatus) 
           :precondition (and 
                          (available ?x)
                          (surface-condition ?x ?oldsurface)
                          (is-smooth ?oldsurface)
                          (colour ?x ?oldcolour)
                          (treatment ?x ?oldtreatment)
                          (grind-treatment-change ?oldtreatment ?newtreatment))
           :effect (and
                    (increase (total-cost) (grind-cost ?x))
                    (not (surface-condition ?x ?oldsurface))
                    (surface-condition ?x verysmooth)
                    (not (treatment ?x ?oldtreatment))
                    (treatment ?x ?newtreatment)
                    (not (colour ?x ?oldcolour))
                    (colour ?x natural)))

  ;; 削ってsmoothに。
  (:action do-plane
           :parameters (?x - part ?m - planer ?oldsurface - surface
                           ?oldcolour - acolour ?oldtreatment - treatmentstatus) 
           :precondition (and 
                          (available ?x)
                          (surface-condition ?x ?oldsurface)
                          (treatment ?x ?oldtreatment)
                          (colour ?x ?oldcolour))
           :effect (and
                    (increase (total-cost) (plane-cost ?x))
                    (not (surface-condition ?x ?oldsurface))
                    (surface-condition ?x smooth)
                    (not (treatment ?x ?oldtreatment))
                    (treatment ?x untreated)
                    (not (colour ?x ?oldcolour))
                    (colour ?x natural)))

  ;; のこぎりで切る機械に入れる。
  (:action load-highspeed-saw
           :parameters (?b - board ?m - highspeed-saw)
           :precondition (and
                          (empty ?m)
                          (available ?b))
           :effect (and
                    (increase (total-cost) 30)
                    (not (available ?b))
                    (not (empty ?m))
                    (in-highspeed-saw ?b ?m)))
  
  ;; のこぎりで切る機械から取り出す。
  (:action unload-highspeed-saw
           :parameters (?b - board ?m - highspeed-saw)
           :precondition (in-highspeed-saw ?b ?m)
           :effect (and
                    (increase (total-cost) 10)
                    (available ?b)
                    (not (in-highspeed-saw ?b ?m))
                    (empty ?m)))
  
  ;; のこぎり機械に入っている場合、小さく切る。
  ;; do-saw-small と違って、時間は10しかかからない。
  ;; 
  (:action cut-board-small
           :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                           ?surface - surface ?size_before ?size_after - aboardsize)
           :precondition (and
                          (unused ?p)
                          (goalsize ?p small)
                          (in-highspeed-saw ?b ?m)
                          (wood ?b ?w)
                          (surface-condition ?b ?surface)
                          (boardsize ?b ?size_before)
                          (boardsize-successor ?size_after ?size_before))
           :effect (and
                    (increase (total-cost) 10)
                    (not (unused ?p))
                    (available ?p)
                    (wood ?p ?w)
                    (surface-condition ?p ?surface)
                    (colour ?p natural)
                    (treatment ?p untreated)
                    (boardsize ?b ?size_after)))

  ;; 中くらいに切る。
  (:action cut-board-medium
           :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                           ?surface - surface 
                           ?size_before ?s1 ?size_after - aboardsize)
           :precondition (and
                          (unused ?p)
                          (goalsize ?p medium)
                          (in-highspeed-saw ?b ?m)
                          (wood ?b ?w)
                          (surface-condition ?b ?surface)
                          (boardsize ?b ?size_before)
                          (boardsize-successor ?size_after ?s1)
                          (boardsize-successor ?s1 ?size_before))
           :effect (and
                    (increase (total-cost) 10)
                    (not (unused ?p))
                    (available ?p)
                    (wood ?p ?w)
                    (surface-condition ?p ?surface)
                    (colour ?p natural)
                    (treatment ?p untreated)
                    (boardsize ?b ?size_after)))

  (:action cut-board-large
           :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                           ?surface - surface 
                           ?size_before ?s1 ?s2 ?size_after - aboardsize)
           :precondition (and
                          (unused ?p)
                          (goalsize ?p large)
                          (in-highspeed-saw ?b ?m)
                          (wood ?b ?w)
                          (surface-condition ?b ?surface)
                          (boardsize ?b ?size_before)
                          (boardsize-successor ?size_after ?s1)
                          (boardsize-successor ?s1 ?s2)
                          (boardsize-successor ?s2 ?size_before))
           :effect (and
                    (increase (total-cost) 10)
                    (not (unused ?p))
                    (available ?p)
                    (wood ?p ?w)
                    (surface-condition ?p ?surface)
                    (colour ?p natural)
                    (treatment ?p untreated)
                    (boardsize ?b ?size_after)))

  ;; 手で板を切り出す。板が大きかろうが小さかろうが30かかる
  ;; 板の大きさは小さくなる。(size_after になる)
  ;; ここらへんは do-saw-small/medium/large全部同じ。
  ;; largeを切りだそうとすると板が3段階小さくなる。
  (:action do-saw-small
           :parameters (?b - board ?p - part ?m - saw ?w - awood
                           ?surface - surface ?size_before ?size_after - aboardsize) 
           :precondition (and 
                          (unused ?p)
                          (goalsize ?p small)
                          (available ?b)
                          (wood ?b ?w)
                          (surface-condition ?b ?surface)
                          (boardsize ?b ?size_before)
                          (boardsize-successor ?size_after ?size_before))
           :effect (and
                    (increase (total-cost) 30)
                    (not (unused ?p))
                    (available ?p)
                    (wood ?p ?w)
                    (surface-condition ?p ?surface)
                    (colour ?p natural) 
                    (treatment ?p untreated)
                    (boardsize ?b ?size_after)))

  (:action do-saw-medium
           :parameters (?b - board ?p - part ?m - saw ?w - awood
                           ?surface - surface 
                           ?size_before ?s1 ?size_after - aboardsize) 
           :precondition (and 
                          (unused ?p)
                          (goalsize ?p medium)
                          (available ?b)
                          (wood ?b ?w)
                          (surface-condition ?b ?surface)
                          (boardsize ?b ?size_before)
                          (boardsize-successor ?size_after ?s1)
                          (boardsize-successor ?s1 ?size_before))
           :effect (and
                    (increase (total-cost) 30)
                    (not (unused ?p))
                    (available ?p)
                    (wood ?p ?w)
                    (surface-condition ?p ?surface)
                    (colour ?p natural) 
                    (treatment ?p untreated)
                    (boardsize ?b ?size_after)))

  (:action do-saw-large
           :parameters (?b - board ?p - part ?m - saw ?w - awood
                           ?surface - surface 
                           ?size_before ?s1 ?s2 ?size_after - aboardsize) 
           :precondition (and 
                          (unused ?p)
                          (goalsize ?p large)
                          (available ?b)
                          (wood ?b ?w)
                          (surface-condition ?b ?surface)
                          (boardsize ?b ?size_before)
                          (boardsize-successor ?size_after ?s1)
                          (boardsize-successor ?s1 ?s2)
                          (boardsize-successor ?s2 ?size_before))
           :effect (and
                    (increase (total-cost) 30)
                    (not (unused ?p))
                    (available ?p)
                    (wood ?p ?w)
                    (surface-condition ?p ?surface)
                    (colour ?p natural) 
                    (treatment ?p untreated)
                    (boardsize ?b ?size_after)))
  )

; problem
; woodworking task with 20 parts and 120% wood
; Machines:
;   3 grinder
;   3 glazer
;   3 immersion-varnisher
;   3 planer
;   3 highspeed-saw
;   3 spray-varnisher
;   3 saw
; random seed: 477863

(define (problem wood-prob-17)
  (:domain woodworking)
  (:objects
    grinder0 grinder1 grinder2 - grinder
    glazer0 glazer1 glazer2 - glazer
    immersion-varnisher0 immersion-varnisher1 immersion-varnisher2 - immersion-varnisher
    planer0 planer1 planer2 - planer
    highspeed-saw0 highspeed-saw1 highspeed-saw2 - highspeed-saw
    spray-varnisher0 spray-varnisher1 spray-varnisher2 - spray-varnisher
    saw0 saw1 saw2 - saw
    black green mauve blue red white - acolour
    oak beech cherry walnut teak - awood
    p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18 p19 - part
    b0 b1 b2 b3 b4 b5 b6 b7 - board
    s0 s1 s2 s3 s4 s5 s6 s7 s8 s9 - aboardsize
  )
  (:init
    (grind-treatment-change varnished colourfragments)
    (grind-treatment-change glazed untreated)
    (grind-treatment-change untreated untreated)
    (grind-treatment-change colourfragments untreated)
    (is-smooth smooth)
    (is-smooth verysmooth)
    (= (total-cost) 0)
    (boardsize-successor s0 s1)
    (boardsize-successor s1 s2)
    (boardsize-successor s2 s3)
    (boardsize-successor s3 s4)
    (boardsize-successor s4 s5)
    (boardsize-successor s5 s6)
    (boardsize-successor s6 s7)
    (boardsize-successor s7 s8)
    (boardsize-successor s8 s9)
    (has-colour glazer0 natural)
    (has-colour glazer1 mauve)
    (has-colour glazer1 natural)
    (has-colour glazer2 mauve)
    (has-colour glazer2 black)
    (has-colour glazer2 red)
    (has-colour immersion-varnisher0 mauve)
    (has-colour immersion-varnisher0 natural)
    (has-colour immersion-varnisher0 green)
    (has-colour immersion-varnisher0 red)
    (has-colour immersion-varnisher0 black)
    (has-colour immersion-varnisher1 black)
    (has-colour immersion-varnisher1 white)
    (has-colour immersion-varnisher1 green)
    (has-colour immersion-varnisher2 white)
    (has-colour immersion-varnisher2 natural)
    (empty highspeed-saw0)
    (empty highspeed-saw1)
    (empty highspeed-saw2)
    (has-colour spray-varnisher0 white)
    (has-colour spray-varnisher1 mauve)
    (has-colour spray-varnisher1 natural)
    (has-colour spray-varnisher1 green)
    (has-colour spray-varnisher1 black)
    (has-colour spray-varnisher2 natural)
    (has-colour spray-varnisher2 white)
    (has-colour spray-varnisher2 green)
    (has-colour spray-varnisher2 red)
    (has-colour spray-varnisher2 black)
    (unused p0)
    (goalsize p0 large)
    (= (spray-varnish-cost p0) 15)
    (= (glaze-cost p0) 20)
    (= (grind-cost p0) 45)
    (= (plane-cost p0) 30)
    (unused p1)
    (goalsize p1 medium)
    (= (spray-varnish-cost p1) 10)
    (= (glaze-cost p1) 15)
    (= (grind-cost p1) 30)
    (= (plane-cost p1) 20)
    (unused p2)
    (goalsize p2 medium)
    (= (spray-varnish-cost p2) 10)
    (= (glaze-cost p2) 15)
    (= (grind-cost p2) 30)
    (= (plane-cost p2) 20)
    (unused p3)
    (goalsize p3 small)
    (= (spray-varnish-cost p3) 5)
    (= (glaze-cost p3) 10)
    (= (grind-cost p3) 15)
    (= (plane-cost p3) 10)
    (unused p4)
    (goalsize p4 large)
    (= (spray-varnish-cost p4) 15)
    (= (glaze-cost p4) 20)
    (= (grind-cost p4) 45)
    (= (plane-cost p4) 30)
    (available p5)
    (colour p5 blue)
    (wood p5 cherry)
    (surface-condition p5 rough)
    (treatment p5 colourfragments)
    (goalsize p5 medium)
    (= (spray-varnish-cost p5) 10)
    (= (glaze-cost p5) 15)
    (= (grind-cost p5) 30)
    (= (plane-cost p5) 20)
    (unused p6)
    (goalsize p6 large)
    (= (spray-varnish-cost p6) 15)
    (= (glaze-cost p6) 20)
    (= (grind-cost p6) 45)
    (= (plane-cost p6) 30)
    (unused p7)
    (goalsize p7 medium)
    (= (spray-varnish-cost p7) 10)
    (= (glaze-cost p7) 15)
    (= (grind-cost p7) 30)
    (= (plane-cost p7) 20)
    (unused p8)
    (goalsize p8 small)
    (= (spray-varnish-cost p8) 5)
    (= (glaze-cost p8) 10)
    (= (grind-cost p8) 15)
    (= (plane-cost p8) 10)
    (unused p9)
    (goalsize p9 medium)
    (= (spray-varnish-cost p9) 10)
    (= (glaze-cost p9) 15)
    (= (grind-cost p9) 30)
    (= (plane-cost p9) 20)
    (unused p10)
    (goalsize p10 medium)
    (= (spray-varnish-cost p10) 10)
    (= (glaze-cost p10) 15)
    (= (grind-cost p10) 30)
    (= (plane-cost p10) 20)
    (unused p11)
    (goalsize p11 small)
    (= (spray-varnish-cost p11) 5)
    (= (glaze-cost p11) 10)
    (= (grind-cost p11) 15)
    (= (plane-cost p11) 10)
    (unused p12)
    (goalsize p12 large)
    (= (spray-varnish-cost p12) 15)
    (= (glaze-cost p12) 20)
    (= (grind-cost p12) 45)
    (= (plane-cost p12) 30)
    (unused p13)
    (goalsize p13 medium)
    (= (spray-varnish-cost p13) 10)
    (= (glaze-cost p13) 15)
    (= (grind-cost p13) 30)
    (= (plane-cost p13) 20)
    (unused p14)
    (goalsize p14 medium)
    (= (spray-varnish-cost p14) 10)
    (= (glaze-cost p14) 15)
    (= (grind-cost p14) 30)
    (= (plane-cost p14) 20)
    (unused p15)
    (goalsize p15 large)
    (= (spray-varnish-cost p15) 15)
    (= (glaze-cost p15) 20)
    (= (grind-cost p15) 45)
    (= (plane-cost p15) 30)
    (unused p16)
    (goalsize p16 small)
    (= (spray-varnish-cost p16) 5)
    (= (glaze-cost p16) 10)
    (= (grind-cost p16) 15)
    (= (plane-cost p16) 10)
    (unused p17)
    (goalsize p17 medium)
    (= (spray-varnish-cost p17) 10)
    (= (glaze-cost p17) 15)
    (= (grind-cost p17) 30)
    (= (plane-cost p17) 20)
    (unused p18)
    (goalsize p18 small)
    (= (spray-varnish-cost p18) 5)
    (= (glaze-cost p18) 10)
    (= (grind-cost p18) 15)
    (= (plane-cost p18) 10)
    (unused p19)
    (goalsize p19 medium)
    (= (spray-varnish-cost p19) 10)
    (= (glaze-cost p19) 15)
    (= (grind-cost p19) 30)
    (= (plane-cost p19) 20)
    (boardsize b0 s5)
    (wood b0 beech)
    (surface-condition b0 smooth)
    (available b0)
    (boardsize b1 s6)
    (wood b1 cherry)
    (surface-condition b1 rough)
    (available b1)
    (boardsize b2 s3)
    (wood b2 cherry)
    (surface-condition b2 rough)
    (available b2)
    (boardsize b3 s9)
    (wood b3 oak)
    (surface-condition b3 rough)
    (available b3)
    (boardsize b4 s2)
    (wood b4 oak)
    (surface-condition b4 rough)
    (available b4)
    (boardsize b5 s5)
    (wood b5 teak)
    (surface-condition b5 rough)
    (available b5)
    (boardsize b6 s9)
    (wood b6 walnut)
    (surface-condition b6 rough)
    (available b6)
    (boardsize b7 s8)
    (wood b7 walnut)
    (surface-condition b7 smooth)
    (available b7)
  )
  (:goal
    (and
      (available p0)
      (wood p0 cherry)
      (surface-condition p0 smooth)
      (available p1)
      (wood p1 walnut)
      (surface-condition p1 smooth)
      (available p2)
      (colour p2 natural)
      (wood p2 beech)
      (surface-condition p2 smooth)
      (treatment p2 varnished)
      (available p3)
      (colour p3 natural)
      (wood p3 cherry)
      (treatment p3 varnished)
      (available p4)
      (surface-condition p4 smooth)
      (treatment p4 glazed)
      (available p5)
      (wood p5 cherry)
      (surface-condition p5 smooth)
      (treatment p5 varnished)
      (available p6)
      (colour p6 white)
      (surface-condition p6 smooth)
      (treatment p6 varnished)
      (available p7)
      (colour p7 black)
      (surface-condition p7 verysmooth)
      (available p8)
      (wood p8 beech)
      (treatment p8 glazed)
      (available p9)
      (wood p9 walnut)
      (surface-condition p9 smooth)
      (treatment p9 glazed)
      (available p10)
      (colour p10 red)
      (wood p10 cherry)
      (available p11)
      (colour p11 green)
      (wood p11 cherry)
      (treatment p11 varnished)
      (available p12)
      (colour p12 mauve)
      (wood p12 walnut)
      (surface-condition p12 verysmooth)
      (available p13)
      (colour p13 black)
      (treatment p13 varnished)
      (available p14)
      (wood p14 walnut)
      (surface-condition p14 smooth)
      (available p15)
      (colour p15 mauve)
      (treatment p15 glazed)
      (available p16)
      (wood p16 beech)
      (treatment p16 varnished)
      (available p17)
      (wood p17 oak)
      (surface-condition p17 smooth)
      (available p18)
      (wood p18 teak)
      (surface-condition p18 smooth)
      (treatment p18 glazed)
      (available p19)
      (colour p19 natural)
      (treatment p19 glazed)
    )
  )
  (:metric minimize (total-cost))
)

; plan
1. (do-plane p5 planer0 rough blue colourfragments)
   deleted: (surface-condition p5 rough) (treatment p5 colourfragments) (colour p5 blue)
   added: (surface-condition p5 smooth) (treatment p5 untreated) (colour p5 natural)
   goals met: 3 of 69
2. (do-immersion-varnish p5 immersion-varnisher0 black smooth)
   deleted: (treatment p5 untreated) (colour p5 natural)
   added: (treatment p5 varnished) (colour p5 black)
   goals met: 4 of 69
3. (do-saw-large b2 p0 saw0 cherry rough s3 s1 s2 s0)
   deleted: (unused p0)
   added: (available p0) (wood p0 cherry) (surface-condition p0 rough) (colour p0 natural) (treatment p0 untreated) (boardsize b2 s0)
   goals met: 6 of 69
4. (do-saw-large b7 p12 saw0 walnut smooth s8 s6 s7 s5)
   deleted: (unused p12)
   added: (available p12) (wood p12 walnut) (surface-condition p12 smooth) (colour p12 natural) (treatment p12 untreated) (boardsize b7 s5)
   goals met: 8 of 69
5. (do-saw-medium b7 p1 saw0 walnut smooth s5 s4 s3)
   deleted: (unused p1)
   added: (available p1) (wood p1 walnut) (surface-condition p1 smooth) (colour p1 natural) (treatment p1 untreated) (boardsize b7 s3)
   goals met: 11 of 69
6. (do-saw-medium b1 p10 saw0 cherry rough s6 s5 s4)
   deleted: (unused p10)
   added: (available p10) (wood p10 cherry) (surface-condition p10 rough) (colour p10 natural) (treatment p10 untreated) (boardsize b1 s4)
   goals met: 13 of 69
7. (do-saw-small b1 p11 saw0 cherry rough s4 s3)
   deleted: (unused p11)
   added: (available p11) (wood p11 cherry) (surface-condition p11 rough) (colour p11 natural) (treatment p11 untreated) (boardsize b1 s3)
   goals met: 15 of 69
8. (do-saw-medium b7 p14 saw0 walnut smooth s3 s2 s1)
   deleted: (unused p14)
   added: (available p14) (wood p14 walnut) (surface-condition p14 smooth) (colour p14 natural) (treatment p14 untreated) (boardsize b7 s1)
   goals met: 18 of 69
9. (do-saw-small b0 p16 saw0 beech smooth s5 s4)
   deleted: (unused p16)
   added: (available p16) (wood p16 beech) (surface-condition p16 smooth) (colour p16 natural) (treatment p16 untreated) (boardsize b0 s4)
   goals met: 20 of 69
10. (do-saw-medium b4 p17 saw0 oak rough s2 s1 s0)
   deleted: (unused p17)
   added: (available p17) (wood p17 oak) (surface-condition p17 rough) (colour p17 natural) (treatment p17 untreated) (boardsize b4 s0)
   goals met: 22 of 69
11. (do-saw-small b5 p18 saw0 teak rough s5 s4)
   deleted: (unused p18)
   added: (available p18) (wood p18 teak) (surface-condition p18 rough) (colour p18 natural) (treatment p18 untreated) (boardsize b5 s4)
   goals met: 24 of 69
12. (do-saw-medium b0 p2 saw0 beech smooth s4 s3 s2)
   deleted: (unused p2)
   added: (available p2) (wood p2 beech) (surface-condition p2 smooth) (colour p2 natural) (treatment p2 untreated) (boardsize b0 s2)
   goals met: 28 of 69
13. (do-saw-small b1 p3 saw0 cherry rough s3 s2)
   deleted: (unused p3)
   added: (available p3) (wood p3 cherry) (surface-condition p3 rough) (colour p3 natural) (treatment p3 untreated) (boardsize b1 s2)
   goals met: 31 of 69
14. (do-saw-small b0 p8 saw0 beech smooth s2 s1)
   deleted: (unused p8)
   added: (available p8) (wood p8 beech) (surface-condition p8 smooth) (colour p8 natural) (treatment p8 untreated) (boardsize b0 s1)
   goals met: 33 of 69
15. (do-saw-medium b6 p9 saw0 walnut rough s9 s8 s7)
   deleted: (unused p9)
   added: (available p9) (wood p9 walnut) (surface-condition p9 rough) (colour p9 natural) (treatment p9 untreated) (boardsize b6 s7)
   goals met: 35 of 69
16. (do-plane p9 planer0 rough natural untreated)
   deleted: (surface-condition p9 rough)
   added: (surface-condition p9 smooth)
   goals met: 36 of 69
17. (do-glaze p9 glazer0 natural)
   deleted: (treatment p9 untreated)
   added: (treatment p9 glazed)
   goals met: 37 of 69
18. (do-glaze p8 glazer0 natural)
   deleted: (treatment p8 untreated)
   added: (treatment p8 glazed)
   goals met: 38 of 69
19. (do-saw-medium b6 p7 saw0 walnut rough s7 s6 s5)
   deleted: (unused p7)
   added: (available p7) (wood p7 walnut) (surface-condition p7 rough) (colour p7 natural) (treatment p7 untreated) (boardsize b6 s5)
   goals met: 39 of 69
20. (do-glaze p7 glazer2 black)
   deleted: (treatment p7 untreated) (colour p7 natural)
   added: (treatment p7 glazed) (colour p7 black)
   goals met: 40 of 69
21. (do-saw-large b6 p6 saw0 walnut rough s5 s3 s4 s2)
   deleted: (unused p6)
   added: (available p6) (wood p6 walnut) (surface-condition p6 rough) (colour p6 natural) (treatment p6 untreated) (boardsize b6 s2)
   goals met: 41 of 69
22. (do-plane p6 planer0 rough natural untreated)
   deleted: (surface-condition p6 rough)
   added: (surface-condition p6 smooth)
   goals met: 42 of 69
23. (do-immersion-varnish p6 immersion-varnisher1 white smooth)
   deleted: (treatment p6 untreated) (colour p6 natural)
   added: (treatment p6 varnished) (colour p6 white)
   goals met: 44 of 69
24. (do-saw-large b5 p4 saw0 teak rough s4 s2 s3 s1)
   deleted: (unused p4)
   added: (available p4) (wood p4 teak) (surface-condition p4 rough) (colour p4 natural) (treatment p4 untreated) (boardsize b5 s1)
   goals met: 45 of 69
25. (do-plane p4 planer0 rough natural untreated)
   deleted: (surface-condition p4 rough)
   added: (surface-condition p4 smooth)
   goals met: 46 of 69
26. (do-glaze p4 glazer0 natural)
   deleted: (treatment p4 untreated)
   added: (treatment p4 glazed)
   goals met: 47 of 69
27. (do-plane p3 planer0 rough natural untreated)
   deleted: (surface-condition p3 rough)
   added: (surface-condition p3 smooth)
   goals met: 47 of 69
28. (do-saw-medium b6 p19 saw0 walnut rough s2 s1 s0)
   deleted: (unused p19)
   added: (available p19) (wood p19 walnut) (surface-condition p19 rough) (colour p19 natural) (treatment p19 untreated) (boardsize b6 s0)
   goals met: 49 of 69
29. (do-glaze p19 glazer0 natural)
   deleted: (treatment p19 untreated)
   added: (treatment p19 glazed)
   goals met: 50 of 69
30. (do-plane p18 planer0 rough natural untreated)
   deleted: (surface-condition p18 rough)
   added: (surface-condition p18 smooth)
   goals met: 51 of 69
31. (do-glaze p18 glazer0 natural)
   deleted: (treatment p18 untreated)
   added: (treatment p18 glazed)
   goals met: 52 of 69
32. (do-plane p17 planer0 rough natural untreated)
   deleted: (surface-condition p17 rough)
   added: (surface-condition p17 smooth)
   goals met: 53 of 69
33. (do-immersion-varnish p16 immersion-varnisher0 black smooth)
   deleted: (treatment p16 untreated) (colour p16 natural)
   added: (treatment p16 varnished) (colour p16 black)
   goals met: 54 of 69
34. (do-saw-large b3 p15 saw0 oak rough s9 s7 s8 s6)
   deleted: (unused p15)
   added: (available p15) (wood p15 oak) (surface-condition p15 rough) (colour p15 natural) (treatment p15 untreated) (boardsize b3 s6)
   goals met: 55 of 69
35. (do-glaze p15 glazer1 mauve)
   deleted: (treatment p15 untreated) (colour p15 natural)
   added: (treatment p15 glazed) (colour p15 mauve)
   goals met: 57 of 69
36. (do-saw-medium b3 p13 saw0 oak rough s6 s5 s4)
   deleted: (unused p13)
   added: (available p13) (wood p13 oak) (surface-condition p13 rough) (colour p13 natural) (treatment p13 untreated) (boardsize b3 s4)
   goals met: 58 of 69
37. (do-plane p13 planer0 rough natural untreated)
   deleted: (surface-condition p13 rough)
   added: (surface-condition p13 smooth)
   goals met: 58 of 69
38. (do-immersion-varnish p13 immersion-varnisher0 black smooth)
   deleted: (treatment p13 untreated) (colour p13 natural)
   added: (treatment p13 varnished) (colour p13 black)
   goals met: 60 of 69
39. (do-glaze p12 glazer1 mauve)
   deleted: (treatment p12 untreated) (colour p12 natural)
   added: (treatment p12 glazed) (colour p12 mauve)
   goals met: 61 of 69
40. (do-plane p11 planer0 rough natural untreated)
   deleted: (surface-condition p11 rough)
   added: (surface-condition p11 smooth)
   goals met: 61 of 69
41. (do-immersion-varnish p11 immersion-varnisher0 green smooth)
   deleted: (treatment p11 untreated) (colour p11 natural)
   added: (treatment p11 varnished) (colour p11 green)
   goals met: 63 of 69
42. (do-glaze p10 glazer2 red)
   deleted: (treatment p10 untreated) (colour p10 natural)
   added: (treatment p10 glazed) (colour p10 red)
   goals met: 64 of 69
43. (do-plane p0 planer0 rough natural untreated)
   deleted: (surface-condition p0 rough)
   added: (surface-condition p0 smooth)
   goals met: 65 of 69
44. (do-immersion-varnish p2 immersion-varnisher0 natural smooth)
   deleted: (treatment p2 untreated)
   added: (treatment p2 varnished)
   goals met: 66 of 69
45. (do-immersion-varnish p3 immersion-varnisher0 natural smooth)
   deleted: (treatment p3 untreated)
   added: (treatment p3 varnished)
   goals met: 67 of 69
46. (do-plane p7 planer0 rough black glazed)
   deleted: (surface-condition p7 rough) (treatment p7 glazed) (colour p7 black)
   added: (surface-condition p7 smooth) (treatment p7 untreated) (colour p7 natural)
   goals met: 66 of 69
47. (do-glaze p7 glazer2 black)
   deleted: (treatment p7 untreated) (colour p7 natural)
   added: (treatment p7 glazed) (colour p7 black)
   goals met: 67 of 69
48. (do-grind p7 grinder0 smooth black glazed untreated)
   deleted: (surface-condition p7 smooth) (treatment p7 glazed) (colour p7 black)
   added: (surface-condition p7 verysmooth) (treatment p7 untreated) (colour p7 natural)
   goals met: 67 of 69
49. (do-glaze p7 glazer2 black)
   deleted: (treatment p7 untreated) (colour p7 natural)
   added: (treatment p7 glazed) (colour p7 black)
   goals met: 68 of 69
50. (do-grind p12 grinder0 smooth mauve glazed untreated)
   deleted: (surface-condition p12 smooth) (treatment p12 glazed) (colour p12 mauve)
   added: (surface-condition p12 verysmooth) (treatment p12 untreated) (colour p12 natural)
   goals met: 68 of 69
51. (do-glaze p12 glazer1 mauve)
   deleted: (treatment p12 untreated) (colour p12 natural)
   added: (treatment p12 glazed) (colour p12 mauve)
   goals met: 69 of 69
